In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 1. Display Top 3 rows of DataSet

In [3]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

# 2.Check last 3 rows of Dataset

In [4]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 3. Find Shape of our Dataset (no. of rows & columns in dataset)

In [6]:
df1.shape

(7, 3)

In [8]:
print("no of rows",df1.shape[0]) #rows
print("no of columns",df1.shape[1]) #columns

no of rows 7
no of columns 3

# 4. Get Information  about our dataset like total number of rows, columns, datatypes of each columns & memory requirements

In [9]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

# 5. Check null values in the dataset

In [10]:
df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

# 6. Get overall Statistics about the dataframe

In [11]:
df1.describe()
#df1.describe() (include='all')

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

# 7.Find unique values from the Gender column

In [13]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

# 8.Find the number of unique values from the gender column

In [15]:
df1['Gender'].nunique() #nunique will bring/count the number of unique values

2

# 9. Display count of unique values in Gender column

In [16]:
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

## 10. Find total number of students having marks between 90 to 100 (inclusive) using between method

In [20]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [23]:
df1[(df1['Marks']>=90) & (df1['Marks']<=90)]

     Name  Marks Gender
4  Parshv     90   Male

In [25]:
df1[df1['Marks'].between(90,100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

## 11. Find Average Marks

In [26]:
df1['Marks'].mean()

92.14285714285714

## 12. Drop the Columns

In [27]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [31]:
df1.drop('Gender', axis=1) #we hadn't use inplace=true here

      Name  Marks
0  Priyang     98
1   Aadhya     89
2   Krisha     99
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     99

## 13. Print name of the columns

In [30]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

##  14. Sort the Dataframe as per the marks column

In [32]:
df1.sort_values(by='Marks')

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

## 15. Display the name & marks of female students

In [33]:
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99